Catalogs/МТ_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МТ_ПредопределенныеЗначения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МТ_ПредопределенныеЗначения/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
//+Гавриленков В. 13.02.2026 #UT10-5690
	
	Для Каждого ТекСтрока Из Список Цикл
		
		Если ТипЗнч(ТекСтрока.Свойство) = Тип("Строка") И ЗначениеЗаполнено(ТекСтрока.Свойство) Тогда
			
			ПодходящееИмяСвойства = СокрЛП(ТекСтрока.Свойство);
			
			Если ТекСтрока.Свойство <> ПодходящееИмяСвойства Тогда
				ТекСтрока.Свойство = ПодходящееИмяСвойства;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ТипЗнч(ТекСтрока.Значение) = Тип("Строка") И ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			
			ПодходящееИмяЗначение = СокрЛП(ТекСтрока.Значение);
			
			Если ТекСтрока.Значение <> ПодходящееИмяЗначение Тогда
				ТекСтрока.Значение = ПодходящееИмяЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

//-Гавриленков В. 13.02.2026 #UT10-5690
КонецПроцедуры
